---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseError
source: html/c49ac111-9bfb-4a36-ef1c-e2253ead68d7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseError Property

The column top can't be moved below its base.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnTopBelowBaseError { get; }
```